data/DUCT/AR_1_Ret_360/constant/V
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3025
(
8.35258866e-12
7.593262421e-12
6.902965831e-12
6.275423485e-12
5.704930447e-12
5.186300395e-12
4.714818553e-12
4.286198678e-12
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           uniform 0;
    }
    wallSide
    {
        type            calculated;
        value           uniform 0;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
