data/DUCT/AR_1_Ret_360/0/k_LES
k_LES nonuniform List<scalar>
3025
(
23.324401880464308
25.161119583398776
28.516106079631545
32.878316301621595
37.769959505882454
42.80969840888248
47.71030369620476
52.30363592340398
...
);
