data/DUCT/AR_1_Ret_360/system/singleGraphDiag
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

#include "../caseDef"
#include "../fieldDef"

hAR     #calc "$h*$AR";

start   (0. 0. 0.);
end     (0. $h $hAR);
fields  $singleGraphFields;

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.

interpolationScheme cellPoint;

setConfig
{
    type lineCell;
    axis xyz;        // y, z, xyz
}


// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
